In [1]:
import pandas as pd

In [2]:
df = pd.read_html('https://sos.ga.gov/elections/election_results/2010_1102/01817.htm')

In [3]:
df = df[2]

In [4]:
df.shape

(4, 6)

In [5]:
df.head(5)

        0     1                     2                3   4   5
0     NaN   NaN  Baxter (NP)  172,364  Totals  172,364 NaN NaN
1     NaN   NaN                100.0%           100.0% NaN NaN
2  County   PPR                   NaN              NaN NaN NaN
3  FULTON  100%                172364           172364 NaN NaN

In [6]:
df = df[3:]

In [7]:
df.head(5)

        0     1       2       3   4   5
3  FULTON  100%  172364  172364 NaN NaN

In [8]:
df = df[df.columns[[0,2]]]

In [9]:
df.head(5)

        0       2
3  FULTON  172364

In [10]:
df.columns = ['county', 'Jerry W. Baxter']

In [11]:
df.tail(5)

   county Jerry W. Baxter
3  FULTON          172364

In [12]:
df = df.melt(id_vars=['county'])

In [13]:
df.columns = ['county', 'candidate', 'votes']

In [14]:
df.head()

   county        candidate   votes
0  FULTON  Jerry W. Baxter  172364

In [16]:
df['votes'] = df['votes'].astype(int)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 477 entries, 0 to 476
Data columns (total 3 columns):
county       477 non-null object
candidate    477 non-null object
votes        477 non-null int64
dtypes: int64(1), object(2)
memory usage: 11.3+ KB

In [18]:
df['office'] = 'Supreme Court Justice'
df['district'] = 'Atlanta Circuit'
df['party'] = 'Non-Partisan'
# df['party'] = 'Democrat'
# df['party'] = 'Republican'

In [21]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate          party
David Nahmias      Non-Partisan    1007828
Matt Wilson        Non-Partisan     346537
Tammy Lynn Adkins  Non-Partisan     735799
Name: votes, dtype: int64

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,APPLING,Supreme Court Justice,,Non-Partisan,Tammy Lynn Adkins,1621
1,ATKINSON,Supreme Court Justice,,Non-Partisan,Tammy Lynn Adkins,434
2,BACON,Supreme Court Justice,,Non-Partisan,Tammy Lynn Adkins,735
3,BAKER,Supreme Court Justice,,Non-Partisan,Tammy Lynn Adkins,368
4,BALDWIN,Supreme Court Justice,,Non-Partisan,Tammy Lynn Adkins,2921

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')